/*
Даны два целых числа aи b, которые могут быть положительными или отрицательными, найдите сумму всех целых чисел между ними и включая их и верните ее. Если два числа равны, верните a или b.

    Примечание: a и b не заказываются!

    Примеры (а, б) --> вывод (пояснение)
(1, 0) --> 1 (1 + 0 = 1)
(1, 2) --> 3 (1 + 2 = 3)
(0, 1) --> 1 (0 + 1 = 1)
(1, 1) --> 1 (1 since both are same)
(-1, 0) --> -1 (-1 + 0 = -1)
(-1, 2) --> 2 (-1 + 0 + 1 + 2 = 2)*/


function getSum(a, b) {

    if (a === b) {
        return a
    } else {
        let sum = 0;
        if (a < b) {
            for (let i = a; i <= b; i++) {
                sum += i
            }
        } else {
            for (let i = b; i <= a; i++) {
                sum += i
            }
        }
        return sum
    }
}

